/* 
  Localizable.strings
  SABnzbdClient

  Created by Michael Voong on 10/03/2012.
  Copyright (c) 2012 Michael Voong. All rights reserved.
*/

"SERVERS_KEY" = "Servers";
"SEARCH_KEY" = "Search";
"NZB_SEARCH_KEY" = "Search";
"SETTINGS_KEY" = "Settings";
"SABNZBD_SERVERS_KEY" = "SABnzbd Servers";
"NZBMATRIX_SETTINGS_KEY" = "NZBMatrix Account";
"CUSTOMISE_CATEGORIES_KEY" = "Categories";
"ALL_KEY" = "All";
"CATEGORIES_TITLE_KEY" = "Search Categories";
"ACTIVE_KEY" = "Active";
"HISTORY_KEY" = "History";
"OTHER_KEY" = "Other";
"PROVIDERS_KEY" = "Providers";
"FEEDS_KEY" = "Feeds";
"NAME_KEY" = "Name";
"HOST_KEY" = "Host";
"PORT_KEY" = "Port";
"USERNAME_KEY" = "Username";
"PASSWORD_KEY" = "Password";
"API_KEY_KEY" = "API Key";
"ENABLE_SCENE_NAME_KEY" = "Enable Scene Name";
"ENABLE_HTTPS_KEY" = "Use HTTPS";
"DEFAULT_SERVER_NAME_KEY" = "My Server";
"NEW_SERVER_NAME_KEY" = "New Server";
"DUPLICATE_KEY" = "Duplicate";
"DUPLICATE_OF_KEY" = "Duplicate of %@";
"NO_ACTIVE_SERVER_KEY" = "No active SABnzbd server configured.";
"CONFIGURE_NZB_MATRIX_KEY" = "Please configure your NZBMatrix account.";
"EMPTY_QUEUE_KEY" = "Nothing In Queue.";
"SHOWING_X_HISTORY_KEY" = "Showing Last 50 History Items";
"PAUSE_KEY" = "Pause";
"SPEED_KEY" = "Speed";
"PAUSED_KEY" = "Paused.";
"DONE_KEY" = "Done";
"PAUSE_INDEFINITELY_KEY" = "Indefinitely";
"SERVICE_STATUS_KEY" = "Service Status";
"INFO_KEY" = "Info";
"ACTIONS_KEY" = "Actions";
"YES_KEY" = "Yes";
"NO_KEY" = "No";
"REMOVE_KEY" = "Remove";
"CANCEL_KEY" = "Cancel";
"FILTERS_KEY" = "Filters";
"PAUSE_DURATION_KEY" = "Pause Duration";
"DONT_PAUSE_KEY" = "Don't Pause";
"MINUTES_KEY" = "%llu minutes";
"HOUR_KEY" = "%llu hour";
"HOURS_KEY" = "%llu hours";
"LIMIT_SPEED_TO_KEY" = "Limit transfer speed to:";
"NO_LIMIT_KEY" = "No Limit";
"KBS_KEY" = "%@ KB/s";
"ACCOUNT_KEY" = "Account";
"MBS_KEY" = "%@ MB/s";
"DOWNLOAD_ADDED_KEY" = "Item Added to Queue.";
"DETAILS_KEY" = "Details";
"NZB_DETAILS_KEY" = "NZB Details";
"ADD_TO_QUEUE_KEY" = "Add to Queue";
"DATE" = "Date";
"PRIORITY" = "Priority";
"SCRIPT" = "Script";
"AGE" = "Age";
"SEARCH_RESULT_NAME_KEY" = "Name";
"SEARCH_RESULT_SIZE_KEY" = "Size";
"SEARCH_RESULT_INDEX_DATE_KEY" = "Index Date";
"SEARCH_RESULT_USENET_DATE_KEY" = "Added";
"SEARCH_RESULT_CATEGORY_KEY" = "Category";
"SEARCH_RESULT_GROUP_KEY" = "Group";
"SEARCH_RESULT_COMMENTS_KEY" = "Comments";
"SEARCH_RESULT_HITS_KEY" = "Hits";
"SEARCH_RESULT_NFO_KEY" = "NFO";
"SEARCH_RESULT_LANGUAGE_KEY" = "Language";
"SEARCH_RESULT_REGION_KEY" = "Region";
"SEARCH_RESULT_LAUNCH_IMDB_KEY" = "IMDB";
"NZB_MATRIX_ACCOUNT_FOOTER" = "To use NZBMatrix functionality you must be an NZBMatrix VIP member. Retrieve your API key from the \"your account\" section on nzbmatrix.com";
"SABNZBD_ACCOUNT_FOOTER" = "Please enter your SABnzbd server details here. Your API key can be found in your SABnzbd web interface under Config > General.\n\nRefer to http://wiki.sabnzbd.org/user-manual for more information and troubleshooting.";
"NZBMATRIX_RSS_KEY" = "NZBMatrix RSS";

// Search categories
"SEARCH_CATEGORY_CATEGORY_KEY" = "Category";
"SEARCH_CATEGORY_MAX_RESULTS_KEY" = "Max Results";

// Adding custom NZB URL
"ADD_NZB_TITLE" = "Add NZB";
"URL" = "URL";
"SABNZBD_SERVER" = "SABnzbd Server";
"ADD" = "Add to Queue";

// Download queue
"SIZE_REMAINING_KEY" = "%@ remaining";

// NZBMatrix error codes
"NZBMATRIX_ERROR_INVALID_LOGIN_KEY" = "Invalid username or API key.";
"NZBMATRIX_ERROR_INVALID_API_KEY" = "There is a problem with the API Key you have provided.";
"NZBMATRIX_ERROR_VIP_ONLY_KEY" = "You need to be VIP or higher to access.";
"NZBMATRIX_ERROR_DISABLED_ACCOUNT_KEY" = "Your account is disabled.";
"NZBMATRIX_ERROR_NO_USER_KEY" = "The user could not be found.";
"NZBMATRIX_ERROR_INVALID_NZBID_KEY" = "There is a problem with the NZBid supplied.";
"NZBMATRIX_ERROR_NO_NZB_FOUND_KEY" = "No NZB found.";
"NZBMATRIX_ERROR_PLEASE_WAIT_X_KEY" = "Please wait x seconds before retry.";
"NZBMATRIX_ERROR_DAILY_LIMIT_KEY" = "You have reached your daily transfer limit.";
"NZBMATRIX_ERROR_NO_SEARCH_KEY" = "No search query given.";
"NZBMATRIX_ERROR_RATE_LIMIT_REACHED_KEY" = "API rate limit reached.";

// General errors
"LOADING_FAILED_KEY" = "Loading Failed.";
"NO_RESULTS_FOUND_KEY" = "No results found.";